funkBuild/esphttpd/test_app/sdkconfig.defaults
# Default configuration for QEMU ESP32S3 testing

# ESP32S3 specific
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# Unity test framework
CONFIG_UNITY_ENABLE_FIXTURE=y
CONFIG_UNITY_ENABLE_IDF_TEST_RUNNER=n

# Optimization for testing
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_ENABLE=y

# Log output
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_COLORS=y
CONFIG_LOG_TIMESTAMP_SOURCE_RTOS=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_ASSERT_ON_UNTESTED_FUNCTION=y

# Main task stack size
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# QEMU specific settings
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y
CONFIG_ESP_SYSTEM_PANIC_SILENT_REBOOT=n

# Disable unnecessary components for faster build
CONFIG_ESP_WIFI_ENABLED=n
CONFIG_BT_ENABLED=n
CONFIG_SPI_FLASH_DANGEROUS_WRITE_ALLOWED=n

# lwIP settings (for socket tests if needed)
CONFIG_LWIP_MAX_SOCKETS=32
CONFIG_LWIP_SO_REUSE=y
CONFIG_LWIP_SO_RCVBUF=y
CONFIG_LWIP_TCP_NODELAY=y

# Software SHA/AES: QEMU's SHA/AES DMA cannot read PSRAM buffers
CONFIG_MBEDTLS_HARDWARE_SHA=n
CONFIG_MBEDTLS_HARDWARE_AES=n

# Memory settings: PSRAM + production memory layout come from
# tools/qemu/sdkconfig.production_memory when built inside esp_node_firmware.
